-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Хост: database:3306
-- Время создания: Апр 25 2025 г., 13:28
-- Версия сервера: 8.3.0
-- Версия PHP: 8.2.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `tenantsandyq`
--

-- --------------------------------------------------------

--
-- Структура таблицы `segments`
--

CREATE TABLE `segments` (
  `id` bigint UNSIGNED NOT NULL,
  `name` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `analysis_type` varchar(255) COLLATE utf8mb4_unicode_ci NOT NULL,
  `is_active` tinyint(1) NOT NULL DEFAULT '1',
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `segments`
--

INSERT INTO `segments` (`id`, `name`, `analysis_type`, `is_active`, `created_at`, `updated_at`) VALUES
(1, 'Активные, низкие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(2, 'Активные, средние траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(3, 'Топ-клиенты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(4, 'Потерянные клиенты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(5, 'Регулярные, низкие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(6, 'Регулярные, средние траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(7, 'Регулярные, высокие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(8, 'Уснувшие, единичные, низкие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(9, 'Уснувшие, единичные, средние траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(10, 'Уснувшие, единичные, высокие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(11, 'Уснувшие, регулярные, низкие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(12, 'Уснувшие, регулярные, средние траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(13, 'Уснувшие, регулярные, высокие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(14, 'Уснувшие, лояльные, низкие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(15, 'Уснувшие, лояльные, средние траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(16, 'Уснувшие, лояльные, высокие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(17, 'Отток, регулярные, низкие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(18, 'Отток, регулярные, средние траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(19, 'Отток, регулярные, высокие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(20, 'Отток, активные, низкие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(21, 'Отток, активные, средние траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(22, 'Отток, топ-клиенты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(23, 'Новички, низкие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(24, 'Новички, средние траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(25, 'Новички, высокие траты', 'RFM', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(26, 'Любители ужина', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(27, 'Лояльные любители пиццы', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(28, 'Чемпионы бонусов', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(29, 'Суперактивные VIP', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(30, 'Частые любители пиццы', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(31, 'Быстрые охотники за бонусами', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(32, 'Активные по выходным', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(33, 'Стабильно частые', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(34, 'Частые, низкие траты', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(35, 'Активные на нескольких устройствах', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00'),
(36, 'Вечерние, низкие траты', 'Mixed', 1, '2025-05-02 00:00:00', '2025-05-02 00:00:00');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `segments`
--
ALTER TABLE `segments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `segments_analysis_type_index` (`analysis_type`),
  ADD KEY `segments_is_active_index` (`is_active`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `segments`
--
ALTER TABLE `segments`
  MODIFY `id` bigint UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=38;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
